app/Http/Controllers/client/authController.php

select * from `orders` where `user_id` = 9 and `orders`.`deleted_at` is null order by `id` desc
---
public function profile()
{

    $data= [];
    $data['orders']=Orders::where('user_id', auth()->user()->id)->orderBy('id', 'DESC')->get();

select * from `users` where `id` = '9' and `users`.`deleted_at` is null limit 1
---
public function profileEdit($id)
{
    $data=[];
    $data['user']=User::where('id',$id)->first();