app/Http/Controllers/client/cartController.php

    public function addToCart(Request $request)
    {



        $cart = [];

        try {
            $this->validate($request, [
                'product_id' => 'required|numeric',
            ]);
        } catch (ValidationException $e) {
            return redirect()->back();
        }

        $product = Product::with('img')->findOrFail($request->input('product_id'));
---
select * from `products` where `products`.`id` = '8' and `products`.`deleted_at` is null limit 1