app/Http/Controllers/client/categoryController.php

select * from `products_category` where `slug` = 'traditional-goods' and `products_category`.`deleted_at` is null limit 1
select * from `products` where `product_category_id` = 1 and `product_active` = 1 and `products`.`deleted_at` is null limit 15 offset 0
select count(*) as aggregate from `products` where `product_category_id` = 1 and `product_active` = 1 and `products`.`deleted_at` is null
select * from `products` where `product_active` = 1 and `products`.`deleted_at` is null order by `id` asc limit 5
select * from `products` where `products`.`id` in (1, 2) and `products`.`deleted_at` is null
select `product_id`, COUNT(product_id) as maxSell from `order_products` where `order_products`.`deleted_at` is null group by `product_id` order by `maxSell` desc limit 4
select * from `products` where `product_active` = 1 and `products`.`deleted_at` is null order by `product_price` desc limit 4
---
    public function catagoryWiseProduct($slug)
    {



        $category=ProductsCategoryModel::where('slug', $slug)->first();
        $allProducts=Product::where('product_category_id',  $category->id)->where('product_active', 1)->paginate(15);
        $recentProducts=Product::where('product_active', 1)->orderBy('id', 'asc')->limit(5)->get();

        $popular_products= OrderProducts::with('product')
        ->select('product_id', DB::raw('COUNT(product_id) as maxSell'))
        ->groupBy('product_id')
        ->orderBy('maxSell', 'desc')
        ->take(4)->get();

        $topRatedProducts= Product::orderBy('product_price', 'desc')->where('product_active', 1)->limit(4)->get();