app/Http/Controllers/client/HomeController.php

    public function index()
    {

        //Server ip
        $UserIP = $_SERVER['REMOTE_ADDR'];
        date_default_timezone_set("Asia/Dhaka");
        $timeDate = date("Y-m-d h:i:sa");
        VisitorTable::insert(['ip_address' => $UserIP, 'visit_time' => $timeDate]);
        //Server ip

        $sliders = SliderModel::all();
        $categories=ProductsCategoryModel::orderBy('id', 'desc')->where('status', 1)->where('is_homePage', 1)->where('parent_id', 0)->limit(5)->get();

  $allCategory=ProductsCategoryModel::orderBy('id', 'desc')->where('status', 1)->get();

        $featureProducts=Product::with(['img'])->where('feture_products', 1)->where('product_active', 1)->take(8)->get();
        $latestProducts=Product::with(['img'])->where('product_active', 1)->orderBy('id', 'desc')->take(8)->get();

        $promo_categories=ProductsCategoryModel::orderBy('id', 'asc')->where('is_homePage', 1)->where('status', 1)->limit(5)->get();

       $popular_products= OrderProducts::with('product')
            ->select('product_id', DB::raw('COUNT(product_id) as maxSell'))
            ->groupBy('product_id')
            ->orderBy('maxSell', 'desc')
            ->take(10)->get();
---
select * from `slider`
select * from `products_category` where `status` = 1 and `is_homePage` = 1 and `parent_id` = 0 and `products_category`.`deleted_at` is null order by `id` desc limit 5
select * from `products_category` where `status` = 1 and `products_category`.`deleted_at` is null order by `id` desc
select * from `products` where `feture_products` = 1 and `product_active` = 1 and `products`.`deleted_at` is null limit 8
select * from `products` where `product_active` = 1 and `products`.`deleted_at` is null order by `id` desc limit 8
select * from `products_category` where `is_homePage` = 1 and `status` = 1 and `products_category`.`deleted_at` is null order by `id` asc limit 5
select * from `products` where `products`.`id` in (1, 2) and `products`.`deleted_at` is null
select `product_id`, COUNT(product_id) as maxSell from `order_products` where `order_products`.`deleted_at` is null group by `product_id` order by `maxSell` desc limit 10

    public function search(Request $request)
    {
        $key=$request->key;

        if($key != ""){
            $searchProducts=Product::with(['img'])->where('product_active', 1)->Where('product_title','LIKE',"%{$key}%")->orderBy('id', 'desc')->paginate(15);

            $popular_products= OrderProducts::with('product')
            ->select('product_id', DB::raw('COUNT(product_id) as maxSell'))
            ->groupBy('product_id')
            ->orderBy('maxSell', 'desc')
            ->take(4)->get();
            $topRatedProducts= Product::orderBy('product_price', 'desc')->where('product_active', 1)->limit(4)->get();
---
select * from `products` where `product_active` = 1 and `product_title` LIKE '%g%' and `products`.`deleted_at` is null order by `id` desc limit 15 offset 0
select count(*) as aggregate from `products` where `product_active` = 1 and `product_title` LIKE '%g%' and `products`.`deleted_at` is null
select * from `products` where `products`.`id` in (1, 2) and `products`.`deleted_at` is null
select `product_id`, COUNT(product_id) as maxSell from `order_products` where `order_products`.`deleted_at` is null group by `product_id` order by `maxSell` desc limit 4
select * from `products` where `product_active` = 1 and `products`.`deleted_at` is null order by `product_price` desc limit 4