app/Http/Controllers/client/productController.php

select * from `products` where `product_slug` = 'three-piece-3' and `product_active` = 1 and `products`.`deleted_at` is null limit 1
---
    public function showProductDetails($slug)
    {


        $productDetails = Product::with('cat', 'img', 'maserment', 'color', 'rating')->where('product_slug', $slug)->where('product_active', 1)->first();