app/Http/Controllers/client/shopController.php

   public function shopIndex()
   {
     $allProducts=product_table::with(['img'])->where('product_active', 1)->orderBy('id', 'desc')->paginate(15);

     $popular_products= OrderProducts::with('product')
            ->select('product_id', DB::raw('COUNT(product_id) as maxSell'))
            ->groupBy('product_id')
            ->orderBy('maxSell', 'desc')
            ->take(4)->get();

    $topRatedProducts= product_table::orderBy('product_price', 'desc')->where('product_active', 1)->limit(4)->get();

    $recentProducts=product_table::where('product_active', 1)->orderBy('id', 'asc')->limit(5)->get();
      return view('client.pages.shop')->with([
          'allProducts'=> $allProducts,
          'popular_products'=> $popular_products,
          'topRatedProducts'=> $topRatedProducts,
          'recentProducts'=> $recentProducts,
          ]);
---
select * from `products` where `products`.`id` in (1, 2) and `products`.`deleted_at` is null
select `product_id`, COUNT(product_id) as maxSell from `order_products` where `order_products`.`deleted_at` is null group by `product_id` order by `maxSell` desc limit 4
select count(*) as aggregate from `products` where `product_active` = 1 and `products`.`deleted_at` is null
select * from `products` where `product_active` = 1 and `products`.`deleted_at` is null order by `id` asc limit 5